# FOA Production Dataset for Pakistan

In [36]:
#Import libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [37]:
foa = pd.read_csv('foastat_pak.csv')
foa.head(3)

,Domain Code,Domain,Area Code,Area,Element Code,Element,Item Code,Item,Year Code,Year,Unit,Value,Ranking
0,QCL,Crops and livestock products,165,Pakistan,5510,Production,156,Sugar cane,2020,2020,tonnes,81009261.0,1
1,QCL,Crops and livestock products,165,Pakistan,5510,Production,951,"Milk, whole fresh buffalo",2020,2020,tonnes,37256000.0,2
2,QCL,Crops and livestock products,165,Pakistan,5510,Production,15,Wheat,2020,2020,tonnes,25247511.0,3

In [38]:
new_foa = foa.drop(['Domain Code', 'Domain', 'Area Code', 'Element Code','Item Code', 'Year Code', 'Year', 'Ranking'], axis=1)
new_foa.head(3)

       Area     Element                       Item    Unit       Value
0  Pakistan  Production                 Sugar cane  tonnes  81009261.0
1  Pakistan  Production  Milk, whole fresh buffalo  tonnes  37256000.0
2  Pakistan  Production                      Wheat  tonnes  25247511.0

In [39]:
new_foa.describe()

              Value
count  1.000000e+01
mean   1.989619e+07
std    2.437812e+07
min    2.434279e+06
25%    4.818406e+06
50%    8.442080e+06
75%    2.456263e+07
max    8.100926e+07

In [40]:
new_foa.mean()

C:\Users\LAPTOP WALA\AppData\Local\Temp\ipykernel_1792\1377323127.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  new_foa.mean()

Value    19896185.9
dtype: float64

In [41]:
new_foa.value_counts(['Value'])

Value
2434279.0     1
3454334.0     1
4552656.0     1
5615657.0     1
8419276.0     1
8464885.0     1
22508000.0    1
25247511.0    1
37256000.0    1
81009261.0    1
dtype: int64

# Saving data set to CSV and import it again

In [42]:
import pandas as pd
import numpy as np
import seaborn as sns

In [43]:
phool=sns.load_dataset('iris')

In [44]:
phool.to_csv('iris.csv')

In [46]:
df = pd.read_csv('iris.csv')
df.head(2)

   Unnamed: 0  sepal_length  sepal_width  petal_length  petal_width species
0           0           5.1          3.5           1.4          0.2  setosa
1           1           4.9          3.0           1.4          0.2  setosa

In [47]:
df.describe()

       Unnamed: 0  sepal_length  sepal_width  petal_length  petal_width
count  150.000000    150.000000   150.000000    150.000000   150.000000
mean    74.500000      5.843333     3.057333      3.758000     1.199333
std     43.445368      0.828066     0.435866      1.765298     0.762238
min      0.000000      4.300000     2.000000      1.000000     0.100000
25%     37.250000      5.100000     2.800000      1.600000     0.300000
50%     74.500000      5.800000     3.000000      4.350000     1.300000
75%    111.750000      6.400000     3.300000      5.100000     1.800000
max    149.000000      7.900000     4.400000      6.900000     2.500000

In [48]:
df.mean()

C:\Users\LAPTOP WALA\AppData\Local\Temp\ipykernel_1792\3698961737.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

Unnamed: 0      74.500000
sepal_length     5.843333
sepal_width      3.057333
petal_length     3.758000
petal_width      1.199333
dtype: float64

In [49]:
df.median()

C:\Users\LAPTOP WALA\AppData\Local\Temp\ipykernel_1792\530051474.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.median()

Unnamed: 0      74.50
sepal_length     5.80
sepal_width      3.00
petal_length     4.35
petal_width      1.30
dtype: float64

In [50]:
df.mode()

,Unnamed: 0,sepal_length,sepal_width,petal_length,petal_width,species
0,0,5.0,3.0,1.4,0.2,setosa
1,1,NaN,NaN,1.5,NaN,versicolor
2,2,NaN,NaN,NaN,NaN,virginica
3,3,NaN,NaN,NaN,NaN,NaN
4,4,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...
145,145,NaN,NaN,NaN,NaN,NaN
146,146,NaN,NaN,NaN,NaN,NaN
147,147,NaN,NaN,NaN,NaN,NaN
148,148,NaN,NaN,NaN,NaN,NaN
149,149,NaN,NaN,NaN,NaN,NaN

In [51]:
df.head()

   Unnamed: 0  sepal_length  sepal_width  petal_length  petal_width species
0           0           5.1          3.5           1.4          0.2  setosa
1           1           4.9          3.0           1.4          0.2  setosa
2           2           4.7          3.2           1.3          0.2  setosa
3           3           4.6          3.1           1.5          0.2  setosa
4           4           5.0          3.6           1.4          0.2  setosa